-- Заполнение таблицы пользователей 'users'
USE YetiCave;
INSERT INTO users (date_add, email, name, password, contact)
VALUES ('2019-10-01', 'as@mail.ru', 'Анатолий Костюк', '147zaq', 'г. Обь'),
       ('2019-10-02', 'af@mail.ru', 'Александр Фролов', '147az', 'г. Барнаул');

-- Заполнение таблицы категорий 'category'
INSERT INTO category (name, code)
VALUES ('Доски и лыжи', 'boards'),
       ('Крепления', 'attachment'),
       ('Ботинки ', 'boots'),
       ('Одежда', 'clothing'),
       ('Инструменты', 'tools'),
       ('Разное', 'other');

-- Заполнение таблицы с лотами 'lots'
INSERT INTO lots (date_add, user_id, category_id, name, content, picture_url, price, date_end, step_rate)
VALUES ('2019-10-01', '1', '1', '2014 Rossignol District Snowboard', 'Описание лота', 'lot-1.jpg', '10999', '2019-10-25 00:00:00', '1'),
       ('2019-10-01', '1', '1', 'DC Ply Mens 2016/2017 Snowboard', 'Описание лота', 'lot-2.jpg', '159999', '2019-10-26 00:00:00', '1'),
       ('2019-10-01', '2', '2', 'Крепления Union Contact Pro 2015 года размер L/X', 'Описание лота', 'lot-3.jpg', '8000', '2019-10-24 00:00:00', '1'),
       ('2019-10-01', '1', '3', 'Ботинки для сноуборда DC Mutiny Charocal', 'Описание лота', 'lot-4.jpg', '10999', '2019-10-28 00:00:00', '1'),
       ('2019-10-01', '2', '4', 'Куртка для сноуборда DC Mutiny Charocal', 'Описание лота', 'lot-5.jpg', '7500', '2019-10-23 00:00:00', '1'),
       ('2019-10-01', '2', '6', 'Маска Oakley Canopy', 'Описание лота', 'lot-6.jpg', '5400', '2019-10-29 00:00:00', '1');

-- Заполнение таблицы ставки 'rate'
INSERT INTO rates (user_id, lot_id, price, date_add)
VALUES ('2', '1', '11000', '2019-10-01'),
       ('2', '2', '16000', '2019-10-01'),
       ('1', '3', '8100', '2019-10-01'),
       ('2', '4', '11500', '2019-10-01'),
       ('1', '5', '7800', '2019-10-01');
